blog-posts/2004-04-15-fancy-striped-tables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fancy striped tables</title>
<!-- 2014-04-30 Wed 17:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Fancy striped tables</h1>
<p>
April 15th, 2004 -
<a href="http://sachachua.com/blog/p/1970"><a href="http://sachachua.com/blog/p/1970">http://sachachua.com/blog/p/1970</a></a>
</p>

<p>
Ephrem wrote:
</p>

<blockquote>
<p>
Here's a bit of magic to make fancy striped tables. The javascript is
from
</p>

<p>
<a href="http://alistapart.com/articles/zebratables/"><a href="http://alistapart.com/articles/zebratables/">http://alistapart.com/articles/zebratables/</a></a>.
4 steps. One caveat, if you have
 multiple tables on a page (not including headers and footers) this
 could result in multiple instances of id=”tabular”. If anyone knows
how to adapt the
 javascript to identify class instead of id, that would be an
improvement.
</p>

<ol class="org-ol">
<li>Edit emacs-wiki-publishing-header and add this javascript somewhere
within
 the head tag:

<pre class="example">
</pre>
</li>

<li>Edit emacs-wiki-publishing-header so that the body tag has an
onload attribute as follows:

<pre class="example">
</pre>
</li>

<li>Edit emacs-wiki-table-attributes so that it includes id=”tabular”:

<pre class="example">
    (setq emacs-wiki-table-attributes "id=\"tabular\" border=\"0\"
cellpadding=\"2\" cellspacing=0")
</pre>
</li>

<li>Add something like the following to your stylesheet:

<pre class="example">
 /*
 // Only tables with the "tabular" id, thereby avoiding header
 // and footer tables.
*/

 table#tabular {
     border: 3px solid #555;
 }


 /*
 // Apply border to all td elements which are not in the first row.
 */

 table#tabular tr + tr&gt;td {
     border-top: 1px solid #aaa;
 }

 table#tabular td {
     padding: .5ex .5em;
 }


 /*
 // Apply left border to all columns except the first.
 */

 table#tabular td + td {
     border-left: 1px dotted #aaa;
 }
</pre>
</li>
</ol>

<p>
E-Mail from ephrem@tuirgin.com
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
